docs/git.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>git</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">git</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga887d98">git baby steps</a>
<ul>
<li><a href="#org8c4665e">k&amp;r</a></li>
<li><a href="#orgb2fe079">baby-git</a></li>
<li><a href="#orgdc9b23f">pro git book</a></li>
<li><a href="#orgb2ea93f">past git GSoC contributors</a></li>
<li><a href="#orge48e7a9">git developer pages</a></li>
<li><a href="#orgc3e5e81">#leftoverbits</a></li>
<li><a href="#org80ec880">GSoC application announcement</a></li>
</ul>
</li>
<li><a href="#org6778300">day 1</a>
<ul>
<li><a href="#orge13e258">pro git</a></li>
<li><a href="#orgbad9415">git exercises</a></li>
<li><a href="#orgdc0fd96">TIL about git shortlog</a></li>
</ul>
</li>
<li><a href="#org76f5861">day 2</a>
<ul>
<li><a href="#org1d07551">Finding list of commands</a></li>
<li><a href="#orgc64fcc2">Let's find out how git add works</a></li>
</ul>
</li>
<li><a href="#org9f7a058">day 3</a></li>
<li><a href="#org1896931">day 4</a>
<ul>
<li><a href="#org25cca75">pro git</a></li>
</ul>
</li>
<li><a href="#org3634a26">day 5</a>
<ul>
<li><a href="#org54659ec">Objects</a>
<ul>
<li><a href="#org1840161">Blobs (binary lapge objects)</a></li>
<li><a href="#org5a5330c">Tree object</a></li>
<li><a href="#org9c2722d">Commit object</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd2c3259">day 6</a>
<ul>
<li><a href="#org1cbe197">Using magit-diff on whats-cooking.txt</a></li>
<li><a href="#orgc2069c7">lei</a></li>
<li><a href="#org6277a47">git clean -n -d</a></li>
<li><a href="#orgcc1fc18">Find initial commit in the git git repo</a></li>
</ul>
</li>
<li><a href="#org1e5acb8">day 7</a>
<ul>
<li><a href="#org07e0e95">Why learn Git internals?</a></li>
<li><a href="#orgb816c96">Introducing: ugit</a></li>
<li><a href="#org04d73af">Why learn Git using code?</a></li>
<li><a href="#org38378aa">Why not learn Git by reading the real Git code?</a></li>
<li><a href="#org34929de">About Me</a></li>
<li><a href="#orge9ebeda">cli: Add argument parser</a></li>
<li><a href="#org423e7df">init: Create new .ugit directory</a></li>
</ul>
</li>
<li><a href="#org47fbd85">day 8</a></li>
</ul>
</div>
</div>
<div id="outline-container-orga887d98" class="outline-2">
<h2 id="orga887d98">git baby steps</h2>
<div class="outline-text-2" id="text-orga887d98">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2025-08-24 Sun&gt;</span></span>
</p>

<p>
These notes are meant to serve as a roadmap for people that come after me, and
are looking to learn enough to be useful and contribute to git.
</p>
</div>
<div id="outline-container-org8c4665e" class="outline-3">
<h3 id="org8c4665e"><a href="https://github.com/ragtux/cnility">k&amp;r</a></h3>
<div class="outline-text-3" id="text-org8c4665e">
<p>
Understanding c thoroughly is important. Treat this as a sacred text.
</p>
</div>
</div>
<div id="outline-container-orgb2fe079" class="outline-3">
<h3 id="orgb2fe079"><a href="https://bitbucket.org/jacobstopak/baby-git">baby-git</a></h3>
<div class="outline-text-3" id="text-orgb2fe079">
<p>
Understanding gits initial commit is something that you are able to do much
easier than reading the current entire codebase.
</p>
</div>
</div>
<div id="outline-container-orgdc9b23f" class="outline-3">
<h3 id="orgdc9b23f"><a href="https://git-scm.com/book/en/v2">pro git book</a></h3>
<div class="outline-text-3" id="text-orgdc9b23f">
<p>
Read this so that you can start learning everything about git. Treat this as one
of your sacred texts.
</p>
</div>
</div>
<div id="outline-container-orgb2ea93f" class="outline-3">
<h3 id="orgb2ea93f"><a href="https://git.github.io/GSoC-Participants/">past git GSoC contributors</a></h3>
<div class="outline-text-3" id="text-orgb2ea93f">
<p>
This is a great resource, it might make sense to review previous work done in
order to familiarize oneself with the process.
</p>
</div>
</div>
<div id="outline-container-orge48e7a9" class="outline-3">
<h3 id="orge48e7a9"><a href="https://git.github.io/">git developer pages</a></h3>
<div class="outline-text-3" id="text-orge48e7a9">
<p>
Use these pages to get a grip on contributing to git.
</p>
</div>
</div>
<div id="outline-container-orgc3e5e81" class="outline-3">
<h3 id="orgc3e5e81"><a href="https://public-inbox.org/git/?q=%23leftoverbits">#leftoverbits</a></h3>
<div class="outline-text-3" id="text-orgc3e5e81">
<p>
Search for this in the mailing list to find potential things you can do.
</p>
</div>
</div>
<div id="outline-container-org80ec880" class="outline-3">
<h3 id="org80ec880"><a href="https://lore.kernel.org/git/CAOLa=ZSHETyzEyyJvP-VT9CbvrJt_jV65nEyCOzR3YGRgFNkrQ@mail.gmail.com/T/#t">GSoC application announcement</a></h3>
<div class="outline-text-3" id="text-org80ec880">
<p>
The GSoC applications for 2025 were due in February.
</p>
</div>
</div>
</div>
<div id="outline-container-org6778300" class="outline-2">
<h2 id="org6778300">day 1</h2>
<div class="outline-text-2" id="text-org6778300">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2025-10-13 Mon&gt;</span></span>
</p>

<p>
Today marks my first day in an experiment i'm conducting on myself. The goal is
to spend at least one hour every day involved in learning about git. Before
starting this, I have done some collecting of sources, and some reading of how
to use git. My abilities with git are good enough for keeping configuration
repositories between my desktop and my laptop, but I still am barely grasping
how git works internally.
</p>
</div>
<div id="outline-container-orge13e258" class="outline-3">
<h3 id="orge13e258"><a href="https://git-scm.com/book/en/v2">pro git</a></h3>
<div class="outline-text-3" id="text-orge13e258">
<p>
Still I have to read through;
</p>

<ul class="org-ul">
<li>Distributed Git</li>
<li>GitHub</li>
<li>Git Tools</li>
<li>Customizing Git</li>
<li>Git and Other Systems</li>
<li>Git Internals</li>
</ul>
</div>
</div>
<div id="outline-container-orgbad9415" class="outline-3">
<h3 id="orgbad9415"><a href="https://gitexercises.fracz.com/">git exercises</a></h3>
<div class="outline-text-3" id="text-orgbad9415">
<p>
I started this a while ago but still need to finish them. I think I could go
through them all again.
</p>
</div>
</div>
<div id="outline-container-orgdc0fd96" class="outline-3">
<h3 id="orgdc0fd96">TIL about git shortlog</h3>
<div class="outline-text-3" id="text-orgdc0fd96">
<p>
This feature is awesome, you can use it to easily see how many commits people
are making to a repository. With the command
</p>
<div class="org-src-container">
<pre class="src src-sh">git shortlog -ns
</pre>
</div>
<p>
you are able to see who has committed the most to a repository. Here is the
output of that command on the git repo;
</p>
<pre class="example" id="org38c2cb2">
27457  Junio C Hamano
 4611  Jeff King
 2390  Johannes Schindelin
 1945  Ævar Arnfjörð Bjarmason
 1824  Nguyễn Thái Ngọc Duy
 1810  Patrick Steinhardt
 1401  Shawn O. Pearce
 1314  René Scharfe
 1203  Elijah Newren
 1118  Linus Torvalds
  954  Michael Haggerty
  902  brian m. carlson
</pre>
<p>
Fascinating. Junio C Hamano is legendary!
</p>
</div>
</div>
</div>
<div id="outline-container-org76f5861" class="outline-2">
<h2 id="org76f5861">day 2</h2>
<div class="outline-text-2" id="text-org76f5861">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2025-10-14 Tue&gt;</span></span>
</p>
<p>
Today I am exploring the git source code and trying to figure out how things
work.
command works.
</p>
</div>
<div id="outline-container-org1d07551" class="outline-3">
<h3 id="org1d07551">Finding list of commands</h3>
<div class="outline-text-3" id="text-org1d07551">
<p>
Git has lots of commands. Here is how you can find where the commands are in the
source. I used the command
</p>
<div class="org-src-container">
<pre class="src src-sh">grep -nr "list of commands"
</pre>
</div>

<p>
to find that there is a list of commands in the git.c file;
</p>

<pre class="example" id="orgeaaa70f">
Documentation/MyFirstContribution.adoc:220:The list of commands lives in `git.c`.
</pre>

<p>
In that file is the list of commands. Here they are cleaned up so that each
command is on a single line;
</p>

<pre class="example" id="org9568993">
"add"
"am"
"annotate"
"apply"
"archive"
"backfill"
"bisect"
"blame"
"branch"
"bugreport"
"bundle"
"cat-file"
"check-attr"
"check-ignore"
"check-mailmap"
"check-ref-format"
"checkout"
"checkout--worker"
"checkout-index"
"cherry"
"cherry-pick"
"clean"
"clone"
"column"
"commit"
"commit-graph"
"commit-tree"
"config"
"count-objects"
"credential"
"credential-cache"
"credential-cache--daemon"
"credential-store"
"describe"
"diagnose"
"diff"
"diff-files"
"diff-index"
"diff-pairs"
"diff-tree"
"difftool"
"fast-export"
"fast-import"
"fetch"
"fetch-pack"
"fmt-merge-msg"
"for-each-ref"
"for-each-repo"
"format-patch"
"fsck"
"fsck-objects"
"fsmonitor--daemon"
"gc"
"get-tar-commit-id"
"grep"
"hash-object"
"help"
"hook"
"index-pack"
"init"
"init-db"
"interpret-trailers"
"last-modified"
"log"
"ls-files"
"ls-remote"
"ls-tree"
"mailinfo"
"mailsplit"
"maintenance"
"merge"
"merge-base"
"merge-file"
"merge-index"
"merge-ours"
"merge-recursive"
"merge-recursive-ours"
"merge-recursive-theirs"
"merge-subtree"
"merge-tree"
"mktag"
"mktree"
"multi-pack-index"
"mv"
"name-rev"
"notes"
"pack-objects"
"pack-redundant"
"pack-refs"
"patch-id"
"pickaxe"
"prune"
"prune-packed"
"pull"
"push"
"range-diff"
"read-tree"
"rebase"
"receive-pack"
"reflog"
"refs"
"remote"
"remote-ext"
"remote-fd"
"repack"
"replace"
"replay"
"repo"
"rerere"
"reset"
"restore"
"rev-list"
"rev-parse"
"revert"
"rm"
"send-pack"
"shortlog"
"show"
"show-branch"
"show-index"
"show-ref"
"sparse-checkout"
"stage"
"stash"
"status"
"stripspace"
"submodule--helper"
"switch"
"symbolic-ref"
"tag"
"unpack-file"
"unpack-objects"
"update-index"
"update-ref"
"update-server-info"
"upload-archive"
"upload-archive--writer"
"upload-pack"
"var"
"verify-commit"
"verify-pack"
"verify-tag"
"version"
"whatchanged"
"worktree"
"write-tree"
</pre>
</div>
</div>
