docs/git.html
<div id="outline-container-orgc64fcc2" class="outline-3">
<h3 id="orgc64fcc2">Let's find out how git add works</h3>
<div class="outline-text-3" id="text-orgc64fcc2">
<p>
Let's focus on a command I've probably used hundreds of times already:
</p>

<div class="org-src-container">
<pre class="src src-sh">git add
</pre>
</div>

<p>
We can find the following in builtins/add.c;
</p>

<div class="org-src-container">
<pre class="src src-C">static struct option builtin_add_options[] = {
  OPT__DRY_RUN(&amp;show_only, N_("dry run")),
  OPT__VERBOSE(&amp;verbose, N_("be verbose")),
  OPT_GROUP(""),
  OPT_BOOL('i', "interactive", &amp;add_interactive, N_("interactive picking")),
  OPT_BOOL('p', "patch", &amp;patch_interactive, N_("select hunks interactively")),
  OPT_DIFF_UNIFIED(&amp;add_p_opt.context),
  OPT_DIFF_INTERHUNK_CONTEXT(&amp;add_p_opt.interhunkcontext),
  OPT_BOOL('e', "edit", &amp;edit_interactive, N_("edit current diff and apply")),
  OPT__FORCE(&amp;ignored_too, N_("allow adding otherwise ignored files"), 0),
  OPT_BOOL('u', "update", &amp;take_worktree_changes, N_("update tracked files")),
  OPT_BOOL(0, "renormalize", &amp;add_renormalize, N_("renormalize EOL of tracked files (implies -u)")),
  OPT_BOOL('N', "intent-to-add", &amp;intent_to_add, N_("record only the fact that the path will be added later")),
  OPT_BOOL('A', "all", &amp;addremove_explicit, N_("add changes from all tracked and untracked files")),
  OPT_CALLBACK_F(0, "ignore-removal", &amp;addremove_explicit,
                 NULL /* takes no arguments */,
                 N_("ignore paths removed in the working tree (same as --no-all)"),
                 PARSE_OPT_NOARG, ignore_removal_cb),
  OPT_BOOL( 0 , "refresh", &amp;refresh_only, N_("don't add, only refresh the index")),
  OPT_BOOL( 0 , "ignore-errors", &amp;ignore_add_errors, N_("just skip files which cannot be added because of errors")),
  OPT_BOOL( 0 , "ignore-missing", &amp;ignore_missing, N_("check if - even missing - files are ignored in dry run")),
  OPT_BOOL(0, "sparse", &amp;include_sparse, N_("allow updating entries outside of the sparse-checkout cone")),
  OPT_STRING(0, "chmod", &amp;chmod_arg, "(+|-)x",
             N_("override the executable bit of the listed files")),
  OPT_HIDDEN_BOOL(0, "warn-embedded-repo", &amp;warn_on_embedded_repo,
                  N_("warn when adding an embedded repository")),
  OPT_PATHSPEC_FROM_FILE(&amp;pathspec_from_file),
  OPT_PATHSPEC_FILE_NUL(&amp;pathspec_file_nul),
  OPT_END(),
};
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org9f7a058" class="outline-2">
<h2 id="org9f7a058">day 3</h2>
<div class="outline-text-2" id="text-org9f7a058">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2025-11-15 Sat&gt;</span></span>
</p>

<p>
Looks like I didn't end up figuring out how git add works. Guess my knowledge of
C is pretty limited, and there are lots of header files involved. Well guess
I'll have to study more. Today I didn't end up doing any work towards my
experiment.
</p>
</div>
</div>
<div id="outline-container-org1896931" class="outline-2">
<h2 id="org1896931">day 4</h2>
<div class="outline-text-2" id="text-org1896931">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2025-11-16 Sun&gt;</span></span>
</p>
</div>
<div id="outline-container-org25cca75" class="outline-3">
<h3 id="org25cca75"><a href="https://git-scm.com/book/en/v2">pro git</a></h3>
<div class="outline-text-3" id="text-org25cca75">
<p>
Still I have to read through;
</p>

<ul class="org-ul">
<li>Git Tools</li>
<li>Customizing Git</li>
<li>Git and Other Systems</li>
<li>Git Internals</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org3634a26" class="outline-2">
<h2 id="org3634a26">day 5</h2>
<div class="outline-text-2" id="text-org3634a26">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2025-10-17 Fri&gt;</span></span>
</p>
<p>
I'm switching to a more bottom up approach. Looking into the git repo at it's
initial commit. Luckily there are already resources available for doing this. I
am not alone in my insanity of trying to understand this project. I found the
baby-git repo which is the initial commit with extra comments for readability. I
also have the Decoding Git book which I am going to work through in addition to
the pro git book. Let's spend an hour reading through the Decoding Book and
taking note of any important findings. Tomorrow I'll contiue off from the object
database heading in chapter 2 of decoding git.
</p>

<p>
The following references are mentioned to being useful.
</p>
<ul class="org-ul">
<li><a href="https://www.gnu.org/software/libc/manual/html_node/index.html">https://www.gnu.org/software/libc/manual/html_node/index.html</a></li>
<li><a href="https://pubs.opengroup.org/onlinepubs/9699919799/">https://pubs.opengroup.org/onlinepubs/9699919799/</a></li>
<li><a href="https://www.cplusplus.com/reference/">https://www.cplusplus.com/reference/</a></li>
<li><a href="https://zlib.net/manual.html">https://zlib.net/manual.html</a></li>
<li><a href="https://zlib.net/zlib_how.html">https://zlib.net/zlib_how.html</a></li>
</ul>

<p>
Git uses thes SHA-1 hash function to map file contents to hash values.
</p>

<p>
There are the following four basic components in Git's initial commit:
</p>
<ul class="org-ul">
<li>objects</li>
<li>an object database</li>
<li>a current directory cache</li>
<li>a working directory</li>
</ul>
</div>
<div id="outline-container-org54659ec" class="outline-3">
<h3 id="org54659ec">Objects</h3>
<div class="outline-text-3" id="text-org54659ec">
<p>
Object types:
</p>
<ul class="org-ul">
<li>blob</li>
<li>tree</li>
<li>commit</li>
</ul>

<p>
An object is an abstraction of data and metadata. It is indexed and referenced
through its hash value. The name of an object is its hash value. This hash value
is used to refer and look up to the specific content.
</p>

<p>
The general structure of an object is:
</p>
<pre class="example" id="orgc44ac6f">
object tag
' '                 (single space)
size of object data (in bytes)
'\0'                (null character)
object binary data
</pre>

<p>
The first part of an object consists of the object metadata. The second part
consists of the object data (the binary data). The space and null byte are used
to seperate the two. The object tag is simply what type of object it is (one of:
blob, tree, commit) and the size of the object data in bytes before deflation.
</p>
</div>
<div id="outline-container-org1840161" class="outline-4">
<h4 id="org1840161">Blobs (binary lapge objects)</h4>
<div class="outline-text-4" id="text-org1840161">
<p>
Woah that just blew my mind, didn's know blobs are just binary large objects.
Any file that the user adds could be a blob, it sould be the binary
representation of a video, plaintext, or any file. Git generates a blob object
that is named, indexed and referenced through the deflated blob objects SHA-1
hash value.
</p>
</div>
</div>
<div id="outline-container-org5a5330c" class="outline-4">
<h4 id="org5a5330c">Tree object</h4>
<div class="outline-text-4" id="text-org5a5330c">
<p>
A tree object contains a list of files aded to a repository. each file has a
mode, path and sha-1 hash. The size of the tree is the sum of the sizes of the
file information entries in the tree object data.
</p>
</div>
</div>
<div id="outline-container-org9c2722d" class="outline-4">
<h4 id="org9c2722d">Commit object</h4>
<div class="outline-text-4" id="text-org9c2722d">
<p>
A commit contains the hash value of a tree object being committed ahd the hash
value of any parent tree objects specified by the user, metadata about the user
who committed the tree, the time and date when the commit was made and a
user-supplied comment known today as the commit message.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd2c3259" class="outline-2">
<h2 id="orgd2c3259">day 6</h2>
<div class="outline-text-2" id="text-orgd2c3259">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2025-10-18 Sat&gt;</span></span>
</p>

<p>
Today I will continue my journey through the decoding git book.
</p>

<p>
Last night I was playing around with gdb. I remembered the tool tig, and
downloaded that. I use magit already, so I am curious if I will need to use tig,
or if magit will be good enough.
</p>
</div>
<div id="outline-container-org1cbe197" class="outline-3">
<h3 id="org1cbe197">Using magit-diff on whats-cooking.txt</h3>
<div class="outline-text-3" id="text-org1cbe197">
<p>
There is a typo in this document, guess the whats-cooking.txt file is kinda
informal and not enough people read it to be nitpicky about typos(?).
</p>
</div>
</div>
<div id="outline-container-orgc2069c7" class="outline-3">
<h3 id="orgc2069c7">lei</h3>
<div class="outline-text-3" id="text-orgc2069c7">
<p>
Here is a link on how I can filter the mail from the kernel mailing lists. Just
putting this here for posterity, probably in the future I will want to have very
specific routing of emails. There is a nice tutorial on setting up automatic
mail to a imap folder. I could probably set this up with my gmail.
<a href="https://people.kernel.org/monsieuricon/lore-lei-part-1-getting-started">https://people.kernel.org/monsieuricon/lore-lei-part-1-getting-started</a>
</p>
</div>
</div>
