content/git.org
** git clean -n -d
I ended up building git a while ago and had a bunch of junk in my next branch. I
searched online for a solution to removing all of that junk. To do this, use
#+begin_src sh
man git-clean
#+end_src
Basically it will show a preview of what happens when you remove all of the
untracked files and directories in your repo. huh, the command is disabled by
default in magit. That is probably for the best it seems like a pretty dangerous
command.
** Find initial commit in the git git repo
use
#+begin_src sh
  git rev-list --max-parents=0 HEAD
#+end_src
to find all commits that have 0 parents. The last hash that is printed;
#+begin_example
e83c5163316f89bfbde7d9ab23ca2e25604af290
#+end_example
corresponds with the initial commit of the git repository. Before doing this,
you are going to want to create a new branch so that you can start screwing
around with the code. I created one called 'blind' which I think is
representative to how I feel compared to much more experienced git users. Then
you can checkout that commit and go to town. Alright that is great to look at I
guess.
* day 7
<2025-10-22>

https://www.leshenko.net/p/ugit/

This is pretty interesting. It is a tutorial that guides you through
implementing a toy git program. I think I will work through this to get a better
understanding of how git works.
** Why learn Git internals?
In order to effectively rebase and merge and do more with the more advanced
features, having a mental model of how git works under the hood will be
beneficial.
** Introducing: ugit
** Why learn Git using code?
** Why not learn Git by reading the real Git code?
** About Me
** cli: Add argument parser
** init: Create new .ugit directory
* day 8
<2025-12-05 Fri>

Today I joined the git discord and expressed interest in contributing to the
sha256 interoperability. I found out that it is being developed in rust. I saw
that the sha256 interoperability is in the latest what's cooking email.

I didn't make significant progress in any of my previous endeavors ...

In general I am trying to get a grip on the resources available to me. I found
the youtube video [[https://www.youtube.com/watch?v=MYn0DHnQggo&t=679][The Zen of Git]] which I am very happy to have watched. I also
found [[https://think-like-a-git.net/sections/experimenting-with-git/references-make-commits-reachable.html][this]] web page that cements the concepts that git is built around. Both
resources deserve annotations. I am quite fascinated with this conceptual
understanding and think that it would be interesting to generate git quizzes
that ask you to construct the graph given certain git commands.
