docs/git.html
<div id="outline-container-org6277a47" class="outline-3">
<h3 id="org6277a47">git clean -n -d</h3>
<div class="outline-text-3" id="text-org6277a47">
<p>
I ended up building git a while ago and had a bunch of junk in my next branch. I
searched online for a solution to removing all of that junk. To do this, use
</p>
<div class="org-src-container">
<pre class="src src-sh">man git-clean
</pre>
</div>
<p>
Basically it will show a preview of what happens when you remove all of the
untracked files and directories in your repo. huh, the command is disabled by
default in magit. That is probably for the best it seems like a pretty dangerous
command.
</p>
</div>
</div>
<div id="outline-container-orgcc1fc18" class="outline-3">
<h3 id="orgcc1fc18">Find initial commit in the git git repo</h3>
<div class="outline-text-3" id="text-orgcc1fc18">
<p>
use
</p>
<div class="org-src-container">
<pre class="src src-sh">git rev-list --max-parents=0 HEAD
</pre>
</div>
<p>
to find all commits that have 0 parents. The last hash that is printed;
</p>
<pre class="example" id="orgf7e2204">
e83c5163316f89bfbde7d9ab23ca2e25604af290
</pre>
<p>
corresponds with the initial commit of the git repository. Before doing this,
you are going to want to create a new branch so that you can start screwing
around with the code. I created one called 'blind' which I think is
representative to how I feel compared to much more experienced git users. Then
you can checkout that commit and go to town. Alright that is great to look at I
guess.
</p>
</div>
</div>
</div>
<div id="outline-container-org1e5acb8" class="outline-2">
<h2 id="org1e5acb8">day 7</h2>
<div class="outline-text-2" id="text-org1e5acb8">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2025-10-22 Wed&gt;</span></span>
</p>

<p>
<a href="https://www.leshenko.net/p/ugit/">https://www.leshenko.net/p/ugit/</a>
</p>

<p>
This is pretty interesting. It is a tutorial that guides you through
implementing a toy git program. I think I will work through this to get a better
understanding of how git works.
</p>
</div>
<div id="outline-container-org07e0e95" class="outline-3">
<h3 id="org07e0e95">Why learn Git internals?</h3>
<div class="outline-text-3" id="text-org07e0e95">
<p>
In order to effectively rebase and merge and do more with the more advanced
features, having a mental model of how git works under the hood will be
beneficial.
</p>
</div>
</div>
<div id="outline-container-orgb816c96" class="outline-3">
<h3 id="orgb816c96">Introducing: ugit</h3>
</div>
<div id="outline-container-org04d73af" class="outline-3">
<h3 id="org04d73af">Why learn Git using code?</h3>
</div>
<div id="outline-container-org38378aa" class="outline-3">
<h3 id="org38378aa">Why not learn Git by reading the real Git code?</h3>
</div>
<div id="outline-container-org34929de" class="outline-3">
<h3 id="org34929de">About Me</h3>
</div>
<div id="outline-container-orge9ebeda" class="outline-3">
<h3 id="orge9ebeda">cli: Add argument parser</h3>
</div>
<div id="outline-container-org423e7df" class="outline-3">
<h3 id="org423e7df">init: Create new .ugit directory</h3>
</div>
</div>
<div id="outline-container-org47fbd85" class="outline-2">
<h2 id="org47fbd85">day 8</h2>
<div class="outline-text-2" id="text-org47fbd85">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2025-12-05 Fri&gt;</span></span>
</p>

<p>
Today I joined the git discord and expressed interest in contributing to the
sha256 interoperability. I found out that it is being developed in rust. I saw
that the sha256 interoperability is in the latest what's cooking email.
</p>

<p>
I didn't make significant progress in any of my previous endeavors &#x2026;
</p>

<p>
In general I am trying to get a grip on the resources available to me. I found
the youtube video <a href="https://www.youtube.com/watch?v=MYn0DHnQggo&amp;t=679">The Zen of Git</a> which I am very happy to have watched. I also
found <a href="https://think-like-a-git.net/sections/experimenting-with-git/references-make-commits-reachable.html">this</a> web page that cements the concepts that git is built around. Both
resources deserve annotations. I am quite fascinated with this conceptual
understanding and think that it would be interesting to generate git quizzes
that ask you to construct the graph given certain git commands.
</p>
</div>
</div>
</div>
</body>
</html>
